Repository: Padina42/positioner
Catalog: positioner/Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_positioner_domain_model_speechbubble
source: speech bubble
de: Sprechblase

# tx_positioner_domain_model_positioner.tx_positioner_right
source: start right
de: von rechts ab

# tx_positioner_domain_model_positioner.tx_positioner_bottom
source: start at bottom
de: von unten ab

# tx_positioner_domain_model_positioner.tx_positioner_padding_top
source: top
de: oben

# tx_positioner_domain_model_positioner.tx_positioner_padding_right
source: right
de: rechts

# tx_positioner_domain_model_positioner.tx_positioner_padding_bottom
source: bottom
de: unten

# tx_positioner_domain_model_positioner.tx_positioner_padding_left
source: left
de: links

# tx_positioner_domain_model_positioner.tx_positioner_from_color
source: select color-code (HTML)
de: HTML-Farbcode zum Austauschen

# tx_positioner_domain_model_positioner.tx_positioner_to_color
source: change to color-code (HTML)
de: HTML-Farbcode zum Einsetzen

# tx_positioner_domain_model_positioner.tx_positioner_dummy_color
source: help-color-code (HTML) for saving image transparency
de: HTML-Farbcode f√ºr Transparenz-Schutz

# tx_positioner_domain_model_positioner.tx_positioner_to_opacity
source: change to Tranparancy (0-100%)
de: Teiltransparenz (0-100%)
