Repository: Padina42/positioner
Catalog: positioner/Resources/Private/Language/*.locallang.xlf
Languages: de

# tx_positioner_domain_model_speechBubble
source: speech bubble
de: Sprechblase

# tx_positioner_domain_model_positioner.tx_section_frame_abs
source: positioner (absolute)
de: Positioner (absolut)

# tx_positioner_domain_model_positioner.tx_positioner_width
source: distance to the border in pixels in the direction of width/X
de: Abstand von Rand in Pixeln in x-Richtung

# tx_positioner_domain_model_positioner.tx_positioner_right
source: if true, the txPositionWidth is relative to the right border
de: Wenn wahr, dann statt des linken relativ zum rechten Rand.

# tx_positioner_domain_model_positioner.tx_positioner_height
source: distance to the border in pixels in the direction of height/Y
de: Abstand ab der Kante in Pixeln in y-Richtung.

# tx_positioner_domain_model_positioner.tx_positioner_bottom
source: if true, the txPositionHeight is relative to the bottom border
de: Wenn wahr, dann statt der oberen relativ zur unteren Kante.

# tx_positioner_domain_model_positioner.tx_content_type
source: positioner-frame
de: Positioner-Rahmen

# tx_positioner_domain_model_positioner.tx_content_desc
source: frame for the positioning
de: Positionsrahmen für positionierte Elemente erstellen

# tx_positioner_domain_model_positioner.tx_speechBubble_type
source: positioner speech bubble
de: Positioner-Sprechblase

# tx_positioner_domain_model_positioner.tx_speechBubble_desc
source: container with text and a background-image
de: Texte in Container mit definierten Hintergrundbild darstellen

# tx_positioner_domain_model_positioner.dimensions
source: dimension of the positioner
de: Dimensionen des Positioners

# tx_positioner_domain_model_positioner.positionerpadding
source: padding frame for underlying image
de: Überhang für das darunter liegende Bild

# tx_positioner_constants_positioner.tx_sub_positionercontent
source: positioned content
de: Positionierter Content

# tx_positioner_constants_positioner.tx_sub_positionerplace
source: positioner elements
de: Positioner-Elemente

# tx_positioner_constants_positioner.tx_sub_speechBubble
source: speech bubble
de: Sprechblase

# tx_positioner_constants_positioner.tx_content_zindex
source: default of z-index:If you define a positioning information for a contentelement , the element will get this default z-index.
de: Vorgabewert z-Index:Wenn ein Element mit mindestens einer Positionsangabe versehen wurde, so ist dies der Defaultwert für den z-Index.

# tx_positioner_constants_positioner.tx_main_tag
source: default of z-index:If you define a positioning information for a content-element, the element will get this default z-index.
de: Vorgabewert z-Index:Wenn ein Element mit mindestens einer Positionsangabe versehen wurde, so ist dies der Defaultwert für den z-Index.

# tx_positioner_constants_positioner.tx_main_idPrefix
source: prefix for positioner-id:You cann define your special attribute for the content-element 'positioner'.
de: Präfix für Positioner-ID:Jedes Positioner-Element erhält eine eigene ID. Um Überschneidungen mit anderen ID-Generatoren zu vermeidenihre Positioner-Box, die meist das Comic-Bild und die Sprechblasen zusammenfasst.

# tx_positioner_constants_positioner.tx_main_attribute
source: positioner-attributes:You cann define your special attributes for your positioner-placeholder.
de: Positioner Attribute:Sie können hier zusätzliche Attribute (class, title, ...) für ihren Positioner Platzhalter definieren.

# tx_positioner_constants_positioner.tx_container_prefixid
source: prefix for spechbubble-id/:Each container for the speechbubble will get an indivual id.
de: Vorsilbe für Sprechblase-ID:Jeder Container einer Sprechblase erhält eine eigenständige ID.

# tx_positioner_constants_positioner.tx_container_event
source: event-attributes for the speechbubble: You can define various attributes for the container of your speechbubble. You should use this field normally for general event-definitions. You can perhaps use it for an onclick-event to play the reading of the speechtext.
de: Ereignis-Attribute für den Sprechtext: Hier kann man dem Container des Contentelements Sprechblasen verschiedene HTML-Attribute zuweisen, wobei es in der Regel Ereignisse-Attribute sein werden. Man könnte zum Beispiel den JavaScript-Code nutzen, um das Vorspielen des gelesenen Sprechblasen-Textes anzustossen.

# tx_positioner_constants_positioner.tx_container_attribute
source: attributes of for the speechbubble:You can give the html-tag of the speechbubble several attributes.
de: Attribute für den Sprechtext:Hier kann man dem Container bzw. HTML-Tag der gesamten Sprechblase weitere Attribute zuweisen.

# tx_positioner_constants_positioner.tx_container_class
source: class of the speechtext: You can define general classes for the container of the speechtext of the speechbubble.
de: Klasse des Sprechtextes: Dem Container der Sprechblase kann generelle Klassen zugeordnet werden.

# tx_positioner_constants_positioner.tx_container_container_element_style
source: CSS-style of the frame of the speech-bubble: The absolute-position is necessary, because on this way the inner text-container will expand the frame and then the frame will expand the speech-bubble.
de: CSS-Style für Rahmen der Sprechblase: Position-Absolute ist wichtig, damit der innere Text-Container die Größe des Rahmens bestimmt, welcher dann die Größe der Sprechblase anpsst.

# tx_positioner_constants_positioner.tx_text_heighorwidth
source: sizing of speechbubble:If you use a speech bubble, the sizing define how the text will expand the image of the speechbubble.
de: Dimensionierungvorgaben:Wenn Sie eine Sprechblase verwenden, so bestimmt der Text über die die Standardbreite über die Standardhöhe, wie die Größe der Sprechblase an den Text angepasst wird.

# tx_positioner_constants_positioner.tx_text_event
source: event-attributes for the speechtext:You can define various attributes for the container of the speechtext. You should use this field normally for general event-definitions. You can perhaps use it for an onclick-event to play the reading of the speechtext.
de: Ereignis-Attribute für den Sprechtext:Hier kann man dem Container des Sprechtextes verschiedene HTML-Attribute zuweisen, wobei es in der Regel Ereignisse-Attribute sein werden. Man könnte zum Beispiel den JavaScript-Code nutzen, um das Vorspielen des gelesenen Sprechblasen-Textes anzustossen.

# tx_positioner_constants_positioner.tx_text_attribute
source: attributes of for the speechtext:You can give the html-tag of the speechbubble-text several attributes.
de: Attribute für den Sprechtext:Hier kann man dem Container bzw. HTML-Tag des Sprechblasentextes weitere Attribute zuweisen.

# tx_positioner_constants_positioner.tx_text_class
source: class of the speechtext: You can define general classes for the container of the speechtext of the speechbubble.
de: Klasse des Sprechtextes: Dem Container des Textes der Sprechblase kann generelle Klassen zugeordnet werden.

# tx_positioner_constants_positioner.tx_canvas_tag
source: CANVAS or DIV:If you want an easy speech bubble, you use the div-tag als you let expand your browser the image of the speech bubble. If you want to use the canvas-tag, you can let construct the browser the speech bubble on the fly.
de: CANVAS oder DIV:Im einfachen Fall skaliert der Browser das Bild für die Sprechblase auf die Größe des Div-Container. Im komfortablen Fall wird die Blase in einem Canvas konstruiert, wobei dann statt des DIV-Tags der CANSAS-Tag zu verwenden ist.

# tx_positioner_constants_positioner.tx_canvas_event
source: event-attributes for speechbubble-image: You can giv the container of the speechbubble-Image various attribute. You should use this normally for general event-definitions. You can perhaps use it for an onclick-event to play the reading of the speechtext.
de: Ereignis-Attribute für das Sprechbalsenbild: Hier kann man dem Container des Sprechblasenbildes verschiedene HTML-Attribute zuweisen, wobei es in der Regel Ereignisse-Attribute sein werden. Man könnte zum Beispiel den JavaScript-Code nutzen, um eine Audioausgabe des Sprechblasen-Textes anzustossen.

# tx_positioner_constants_positioner.tx_canvas_attribute
source: attributes of speechbubble-image:You can give the container of the image of your speechbubble individual attribtues.
de: Attribute für Sprechblasen-Bild:Hier kann man dem Container des Bildes der Sprechblase verschiedene Attribute zuweisen.

# tx_positioner_constants_positioner.tx_canvas_class
source: class of speechbubble-image: You can define general classes for the container of the image which shows the speechbubble.
de: Klasse des Sprechblasebildes: Dem Container des Bildes der Sprechblase kann eigene Klassen zugeordnet werden.

# tx_positioner_constants_positioner.tx_bubble_from_color
source: code of source-color (HTML):color code from 00000 to FFFFFF without diamond
de: HTML-Code der auszutauschenden Farbe:Farbcode von 00000 bis FFFFFF ohne Raute

# tx_positioner_constants_positioner.tx_bubble_to_color
source: code of destination-color (HTML):color code from 00000 to FFFFFF without diamond
de: HTML-Code der einzufügenden Farbe:Farbcode von 00000 bis FFFFFF ohne Raute

# tx_positioner_constants_positioner.tx_bubble_dummy_color
source: code of the colo for saving the tranparancy:color code from 00000 to FFFFFF without diamond
de: HTML-Code für Schutzfarbe der Transparenz:Farbcode von 00000 bis FFFFFF ohne Raute

# tx_positioner_constants_positioner.tx_js_flagjquerylibary
source: fade of jQuery: Want you use the jQuery-libary of this extension, which is defined after this? (It is believed that you have already integrated jQuery and don't want a double integrationen of jQuery.)
de: jQuery Ausblendung:Soll die Extension die jQuery-Bibliiothek einbinden, die in 'tx_js_jqueryframe' definiert wird? (Es wird vermutet, dass Sie jQuery schon eingebunden haben und dass Sie keine Zweitintegration von jQuery wünschen.)

# tx_positioner_constants_positioner.tx_js_jqueryframe
source: path of jQuery: If you enter a different path here, you should set the above constants tx_js_flagjquerylibary to true.
de: jQuery-Pfad: Wenn Sie einen anderen Pfad hier eintragen, dann sollten Sie auch die obige Konstante 'tx_js_flagjquerylibary' auf true setzen.

# tx_positioner_constants_positioner.tx_js_flagaudiolibary
source: Usage of scripts for audio-play?:Want you use the two javascript-libarys, the simple CCS-file and the flash-definition to force the audio-play? (These files and a jQuery-Framework are needed to make the audio play of speech-bubbles possible.)
de: Nutzen der Scripte für Audio-Ausspielung?:Soll die Extension die beiden nachfolgenden javascript-Bibliiotheken, die kurze CSS-Datei sowie die Flash-Definition nutzen? (Die nachfolgend genannte Dateien sinid neben dem jQuery-Framwork nötig, um die Audio-Ausspielung Sprechblasen zu ermöglichen.)

# tx_positioner_constants_positioner.tx_js_jplayersource
source: player-framework:The javascript-libary contains all javascript-methods, you need for using the player.
de: Ausspielung-Framework: Die JavaScript-Bibliothek stellt alle javascript-Funktionalitäten für den Player zur Verfügung.

# tx_positioner_constants_positioner.tx_js_jplayerevent
source: eventcontol of speech-bubble: In the above constants 'tx_positioner.speechBubble.container.event' is defined javascript code per default for onclick events. The javascript library links the player with the events in the speech bubble. (It's assumed, that you want to use the functionality of speech-bubbles.)
de: Ereignisssteuerung für Sprechblasen: In der obigen Konstanten 'container.event' ist javascript-Code für onclick-Ereignisse definiert. Die Javascript-Bibliothek verknüpft den Player mit der Ereignissen bei der Sprechblase. (Es wird angenommen, dass Sie die Funktionalität der abhörbaren Sprechblasen nutzen wollen.)

# tx_positioner_constants_positioner.tx_css_audiostyle
source: CSS definitions:
de: CSS-Definitionen:
